Revit 2027 API
ElementNode.ElementId Property
 The Id of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementNode Class
Autodesk.Revit.DB Namespace